backend/tests/LoadTests/results/email-followup-load-20260503-093641.txt

          /\      |ΓÇ╛ΓÇ╛| /ΓÇ╛ΓÇ╛/   /ΓÇ╛ΓÇ╛/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ΓÇ╛ΓÇ╛\  
   /          \   |  |\  \ |  (ΓÇ╛)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: .\email-followup-load.js
        output: -

     scenarios: (100.00%) 1 scenario, 3 max VUs, 45s max duration (incl. graceful stop):
              * smoke: 3 looping VUs for 40s (exec: smokeSuite, gracefulStop: 5s)


running (01.0s), 3/3 VUs, 0 complete and 0 interrupted iterations
smoke   [   2% ] 3 VUs  00.8s/40s

running (02.0s), 3/3 VUs, 0 complete and 0 interrupted iterations
smoke   [   5% ] 3 VUs  01.8s/40s

running (03.0s), 3/3 VUs, 3 complete and 0 interrupted iterations
smoke   [   7% ] 3 VUs  02.8s/40s

running (04.0s), 3/3 VUs, 6 complete and 0 interrupted iterations
smoke   [  10% ] 3 VUs  03.8s/40s

running (05.0s), 3/3 VUs, 9 complete and 0 interrupted iterations
smoke   [  12% ] 3 VUs  04.8s/40s

running (06.0s), 3/3 VUs, 12 complete and 0 interrupted iterations
smoke   [  15% ] 3 VUs  05.8s/40s

running (07.0s), 3/3 VUs, 15 complete and 0 interrupted iterations
smoke   [  17% ] 3 VUs  06.8s/40s

running (08.0s), 3/3 VUs, 18 complete and 0 interrupted iterations
smoke   [  20% ] 3 VUs  07.8s/40s

running (09.0s), 3/3 VUs, 21 complete and 0 interrupted iterations
smoke   [  22% ] 3 VUs  08.8s/40s

running (10.0s), 3/3 VUs, 24 complete and 0 interrupted iterations
smoke   [  25% ] 3 VUs  09.8s/40s

running (11.0s), 3/3 VUs, 28 complete and 0 interrupted iterations
smoke   [  27% ] 3 VUs  10.8s/40s

running (12.0s), 3/3 VUs, 31 complete and 0 interrupted iterations
smoke   [  30% ] 3 VUs  11.8s/40s

running (13.0s), 3/3 VUs, 34 complete and 0 interrupted iterations
smoke   [  32% ] 3 VUs  12.8s/40s

running (14.0s), 3/3 VUs, 38 complete and 0 interrupted iterations
smoke   [  35% ] 3 VUs  13.8s/40s

running (15.0s), 3/3 VUs, 41 complete and 0 interrupted iterations
smoke   [  37% ] 3 VUs  14.8s/40s

running (16.0s), 3/3 VUs, 45 complete and 0 interrupted iterations
smoke   [  39% ] 3 VUs  15.8s/40s

running (17.0s), 3/3 VUs, 48 complete and 0 interrupted iterations
smoke   [  42% ] 3 VUs  16.8s/40s

running (18.0s), 3/3 VUs, 51 complete and 0 interrupted iterations
smoke   [  45% ] 3 VUs  17.8s/40s

running (19.0s), 3/3 VUs, 54 complete and 0 interrupted iterations
smoke   [  47% ] 3 VUs  18.8s/40s

running (20.0s), 3/3 VUs, 55 complete and 0 interrupted iterations
smoke   [  50% ] 3 VUs  19.8s/40s

running (21.0s), 3/3 VUs, 55 complete and 0 interrupted iterations
smoke   [  52% ] 3 VUs  20.8s/40s

running (22.0s), 3/3 VUs, 55 complete and 0 interrupted iterations
smoke   [  55% ] 3 VUs  21.8s/40s

running (23.0s), 3/3 VUs, 55 complete and 0 interrupted iterations
smoke   [  57% ] 3 VUs  22.8s/40s

running (24.0s), 3/3 VUs, 55 complete and 0 interrupted iterations
smoke   [  60% ] 3 VUs  23.8s/40s

running (25.0s), 3/3 VUs, 55 complete and 0 interrupted iterations
smoke   [  62% ] 3 VUs  24.8s/40s

running (26.0s), 3/3 VUs, 55 complete and 0 interrupted iterations
smoke   [  64% ] 3 VUs  25.8s/40s

running (27.0s), 3/3 VUs, 55 complete and 0 interrupted iterations
smoke   [  67% ] 3 VUs  26.8s/40s

running (28.0s), 3/3 VUs, 55 complete and 0 interrupted iterations
smoke   [  70% ] 3 VUs  27.8s/40s

running (29.0s), 3/3 VUs, 55 complete and 0 interrupted iterations
smoke   [  72% ] 3 VUs  28.8s/40s

running (30.0s), 3/3 VUs, 55 complete and 0 interrupted iterations
smoke   [  75% ] 3 VUs  29.8s/40s

running (31.0s), 3/3 VUs, 55 complete and 0 interrupted iterations
smoke   [  77% ] 3 VUs  30.8s/40s

running (32.0s), 3/3 VUs, 56 complete and 0 interrupted iterations
smoke   [  80% ] 3 VUs  31.8s/40s

running (33.0s), 3/3 VUs, 57 complete and 0 interrupted iterations
smoke   [  82% ] 3 VUs  32.8s/40s

running (34.0s), 3/3 VUs, 57 complete and 0 interrupted iterations
smoke   [  85% ] 3 VUs  33.8s/40s

running (35.0s), 3/3 VUs, 57 complete and 0 interrupted iterations
smoke   [  87% ] 3 VUs  34.8s/40s

running (36.0s), 3/3 VUs, 57 complete and 0 interrupted iterations
smoke   [  90% ] 3 VUs  35.8s/40s

running (37.0s), 3/3 VUs, 57 complete and 0 interrupted iterations
smoke   [  92% ] 3 VUs  36.8s/40s

running (38.0s), 3/3 VUs, 57 complete and 0 interrupted iterations
smoke   [  95% ] 3 VUs  37.8s/40s

running (39.0s), 3/3 VUs, 57 complete and 0 interrupted iterations
smoke   [  97% ] 3 VUs  38.8s/40s

running (40.0s), 3/3 VUs, 57 complete and 0 interrupted iterations
smoke   [ 100% ] 3 VUs  39.8s/40s

running (41.0s), 3/3 VUs, 57 complete and 0 interrupted iterations
smoke Γåô [ 100% ] 3 VUs  40s

running (42.0s), 3/3 VUs, 57 complete and 0 interrupted iterations
smoke Γåô [ 100% ] 3 VUs  40s

running (43.0s), 3/3 VUs, 57 complete and 0 interrupted iterations
smoke Γåô [ 100% ] 3 VUs  40s

running (44.0s), 3/3 VUs, 57 complete and 0 interrupted iterations
smoke Γåô [ 100% ] 3 VUs  40s

running (45.0s), 2/3 VUs, 58 complete and 0 interrupted iterations
smoke Γåô [ 100% ] 3 VUs  40s

     Γ£ù status valid (lead-intake)
      Γå│  0% ΓÇö Γ£ô 0 / Γ£ù 60
     Γ£ù status valid (dispatch-execute-due)
      Γå│  0% ΓÇö Γ£ô 0 / Γ£ù 30
     Γ£ù status is 200 (email-kpis)
      Γå│  0% ΓÇö Γ£ô 0 / Γ£ù 20
     Γ£ô status is 200 (followup-jobs)

     Γûê setup

       Γ£ô setup smtp settings is 200

     checks.........................: 12.69% Γ£ô 16       Γ£ù 110
     data_received..................: 98 kB  2.2 kB/s
     data_sent......................: 28 kB  617 B/s
   Γ£ù failures.......................: 88.00% Γ£ô 110      Γ£ù 15 
     http_req_blocked...............: avg=180.13┬╡s min=0s       med=0s       max=19.01ms  p(90)=0s       p(95)=0s    
     http_req_connecting............: avg=38.26┬╡s  min=0s       med=0s       max=1.13ms   p(90)=0s       p(95)=0s    
   Γ£ù http_req_duration..............: avg=622.42ms min=511.7┬╡s  med=13.21ms  max=12.01s   p(90)=78.4ms   p(95)=1.46s 
       { expected_response:true }...: avg=20.19ms  min=511.7┬╡s  med=1.55ms   max=182.25ms p(90)=45.44ms  p(95)=84.3ms
   Γ£ù http_req_failed................: 87.30% Γ£ô 110      Γ£ù 16 
     http_req_receiving.............: avg=266.55┬╡s min=0s       med=0s       max=1.51ms   p(90)=998.25┬╡s p(95)=1ms   
     http_req_sending...............: avg=21.64┬╡s  min=0s       med=0s       max=1ms      p(90)=0s       p(95)=0s    
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s    
     http_req_waiting...............: avg=622.14ms min=511.7┬╡s  med=12.85ms  max=12.01s   p(90)=78.4ms   p(95)=1.46s 
     http_reqs......................: 126    2.786808/s
     iteration_duration.............: avg=1.61s    min=202.05ms med=935.41ms max=13.03s   p(90)=1.34s    p(95)=3.5s  
     iterations.....................: 58     1.282816/s
     vus............................: 2      min=2      max=3
     vus_max........................: 3      min=3      max=3


running (45.2s), 0/3 VUs, 58 complete and 2 interrupted iterations
smoke Γ£ô [ 100% ] 3 VUs  40s